app/controllers/profiles_controller.rb

  def index
    @profile = Profile.first
---
SELECT  "profiles".* FROM "profiles" ORDER BY "profiles"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "email", "github", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bruna"], ["email", "bruna@gmail"], ["github", "souzabruna"], ["bio", "gggg"], ["created_at", 2016-09-14 17:55:13 UTC], ["updated_at", 2016-09-14 17:55:13 UTC]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "name" = ?, "email" = ?, "github" = ?, "bio" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["name", "Kenai"], ["email", "kenai@cachorro.com"], ["github", "kenaicachorro"], ["bio", "cachorro preto"], ["updated_at", 2016-09-15 17:19:10 UTC], ["id", 1]]