app/controllers/skills_controller.rb

INSERT INTO "skills" ("name", "year", "created_at", "updated_at", "profile_id") VALUES (?, ?, ?, ?, ?)  [["name", "Fazer Café"], ["year", 18], ["created_at", 2016-09-15 18:06:17 UTC], ["updated_at", 2016-09-15 18:06:17 UTC], ["profile_id", 1]]
---
  def create
    @skill = Skill.new(skill_params)
    @skill.profile_id = 1

    respond_to do |format|
      if @skill.save

UPDATE "skills" SET "name" = ?, "year" = ?, "updated_at" = ? WHERE "skills"."id" = ?  [["name", "Ruby"], ["year", 0], ["updated_at", 2016-09-14 18:00:06 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @skill.update(skill_params)